tutorials/incompressibleFluid/roomResidenceTime/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)             // 0
    (0 0 2.05)
    (0 1.65 2.05)
    (0 1.65 0)

    (3.8 0 0)           // 4
    (3.8 0 2.05)
    (3.8 1.65 2.05)
    (3.8 1.65 0)

    (4 0 0)             // 8
    (4 0 2.05)
    (4 1.65 2.05)
    (4 1.65 0)

    (4.2 0 0)           // 12
    (4.2 0 2.05)
    (4.2 1.65 2.05)
    (4.2 1.65 0)

    (0 1.95 0)          // 16
    (0 1.95 2.05)
    (3.8 1.95 0)
    (3.8 1.95 2.05)

    (4 1.95 0)          // 20
    (4 1.95 2.05)
    (4.2 1.95 0)
    (4.2 1.95 2.05)

    (0 3.6 0)          // 24
    (0 3.6 2.05)
    (3.8 3.6 0)
    (3.8 3.6 2.05)

    (4 3.6 0)          // 28
    (4 3.6 2.05)
    (4.2 3.6 0)
    (4.2 3.6 2.05)

    (0 0 2.25)         // 32
    (0 1.65 2.25)
    (3.8 0 2.25)
    (3.8 1.65 2.25)

    (4 0 2.25)         // 36
    (4 1.65 2.25)
    (4.2 0 2.25)
    (4.2 1.65 2.25)

    (0 1.95 2.25)      // 40
    (3.8 1.95 2.25)
    (4 1.95 2.25)
    (4.2 1.95 2.25)

    (0 3.6 2.25)       // 44
    (3.8 3.6 2.25)
    (4 3.6 2.25)
    (4.2 3.6 2.25)

    (0 0 3)            // 48
    (0 1.65 3)
    (3.8 0 3)
    (3.8 1.65 3)

    (4 0 3)            // 52
    (4 1.65 3)
    (4.2 0 3)
    (4.2 1.65 3)

    (0 1.95 3)         // 56
    (0 3.6 3)
    (3.8 1.95 3)
    (3.8 3.6 3)

    (4 1.95 3)         // 60
    (4 3.6 3)
    (4.2 1.95 3)
    (4.2 3.6 3)
);

blocks
(
    hex (0 3 2 1 4 7 6 5)
    (21 20 35)
    simpleGrading (1 1 1)

    hex (4 7 6 5 8 11 10 9)
    (21 20 2)
    simpleGrading (1 1 1)

    hex (8 11 10 9 12 15 14 13)
    (21 20 2)
    simpleGrading (1 1 1)

    hex (3 16 17 2 7 18 19 6)
    (4 20 35)
    simpleGrading (1 1 1)

    hex (7 18 19 6 11 20 21  10)
    (4 20 2)
    simpleGrading (1 1 1)

    hex (11 20 21 10 15 22 23 14)
    (4 20 2)
    simpleGrading (1 1 1)

    hex (16 24 25 17 18 26 27 19)
    (21 20 35)
    simpleGrading (1 1 1)

    hex (18 26 27 19 20 28 29 21)
    (21 20 2)
    simpleGrading (1 1 1)

    hex (20 28 29 21 22 30 31 23)
    (21 20 2)
    simpleGrading (1 1 1)

    hex (1 2 33 32 5 6 35 34)
    (21 2 35)
    simpleGrading (1 1 1)

    hex (5 6 35 34 9 10 37 36)
    (21 2 2)
    simpleGrading (1 1 1)

    hex (9 10 37 36 13 14 39 38)
    (21 2 2)
    simpleGrading (1 1 1)

    hex (2 17 40 33 6 19 41 35)
    (4 2 35)
    simpleGrading (1 1 1)

    hex (6 19 41 35 10 21 42 37)
    (4 2 2)
    simpleGrading (1 1 1)

    hex (10 21 42 37 14 23 43 39)
    (4 2 2)
    simpleGrading (1 1 1)

    hex (17 25 44 40 19 27 45 41)
    (21 2 35)
    simpleGrading (1 1 1)

    hex (19 27 45 41 21 29 46 42)
    (21 2 2)
    simpleGrading (1 1 1)

    hex (21 29 46 42 23 31 47 43)
    (21 2 2)
    simpleGrading (1 1 1)

    hex (32 33 49 48 34 35 51 50)
    (21 8 35)
    simpleGrading (1 1 1)

    hex (34 35 51 50 36 37 53 52)
    (21 8 2)
    simpleGrading (1 1 1)

    hex (36 37 53 52 38 39 55 54)
    (21 8 2)
    simpleGrading (1 1 1)

    hex (33 40 56 49 35 41 58 51)
    (4 8 35)
    simpleGrading (1 1 1)

    hex (35 41 58 51 37 42 60 53)
    (4 8 2)
    simpleGrading (1 1 1)

    hex (37 42 60 53 39 43 62 55)
    (4 8 2)
    simpleGrading (1 1 1)

    hex (40 44 57 56 41 45 59 58)
    (21 8 35)
    simpleGrading (1 1 1)

    hex (41 45 59 58 42 46 61 60)
    (21 8 2)
    simpleGrading (1 1 1)

    hex (42 46 61 60 43 47 63 62)
    (21 8 2)
    simpleGrading (1 1 1)
);

defaultPatch
{
    name walls;
    type wall;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (2 17 40 33)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (51 58 60 53)
        );
    }
);

// ************************************************************************* //
